/* Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.
M = 1; N = 15 -> 120
M = 4; N = 8. -> 30 */

int Sum(int m, int n)  
{
    if(m < n) return Sum(m + 1, n) + m;
    else return m;
}
Console.Write(Sum(4,15));

/////////////////////////////////////////////////////////////////////////////////////////
/* Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
m = 2, n = 3 -> A(m,n) = 29   ????29????*/

// int Akkerman (int m, int n)
// {
//     if (m == 0) return n + 1;
//     else
//         if (m != 0 && n == 0) return Akkerman(m - 1, 1);
//         else
//             return Akkerman(m - 1, Akkerman(m, n - 1));
    
// }

// Console.WriteLine(Akkerman(1, 2));